{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "UnlabeledInput", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "name": "UnlabeledInput"}, "inbound_nodes": []}, {"name": "ae_0", "class_name": "Dense", "config": {"name": "ae_0", "trainable": true, "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["UnlabeledInput", 0, 0, {}]]]}, {"name": "ae_1", "class_name": "Dense", "config": {"name": "ae_1", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ae_0", 0, 0, {}]]]}], "input_layers": [["UnlabeledInput", 0, 0]], "output_layers": [["ae_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}